vamoirid/STM32-Vehicle-Software/3. Auxiliary PCB 2019 Code/Aux 2019 Code/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PCB_Thermistor_Pin GPIO_PIN_0
#define PCB_Thermistor_GPIO_Port GPIOC
#define BSPD_OK_Signal_Pin GPIO_PIN_3
#define BSPD_OK_Signal_GPIO_Port GPIOC
#define Susp_RL_Pin GPIO_PIN_0
#define Susp_RL_GPIO_Port GPIOA
#define Susp_RR_Pin GPIO_PIN_1
#define Susp_RR_GPIO_Port GPIOA
#define Left_Flow_Meter_Pin GPIO_PIN_2
#define Left_Flow_Meter_GPIO_Port GPIOA
#define Right_Flow_Meter_Pin GPIO_PIN_3
#define Right_Flow_Meter_GPIO_Port GPIOA
#define Left_Pump_Signal_Pin GPIO_PIN_4
#define Left_Pump_Signal_GPIO_Port GPIOA
#define Right_Pump_Signal_Pin GPIO_PIN_5
#define Right_Pump_Signal_GPIO_Port GPIOA
#define DCDC_Thermistor_Pin GPIO_PIN_6
#define DCDC_Thermistor_GPIO_Port GPIOA
#define Safe_State_Pin GPIO_PIN_7
#define Safe_State_GPIO_Port GPIOA
#define DCDC_Enable_Pin GPIO_PIN_5
#define DCDC_Enable_GPIO_Port GPIOC
#define DCDC_MOD_Pin GPIO_PIN_1
#define DCDC_MOD_GPIO_Port GPIOB
#define DCDC_PG_Pin GPIO_PIN_2
#define DCDC_PG_GPIO_Port GPIOB
#define Accu_Fans_PWM_Pin GPIO_PIN_15
#define Accu_Fans_PWM_GPIO_Port GPIOB
#define Left_Fans_PWM_Pin GPIO_PIN_6
#define Left_Fans_PWM_GPIO_Port GPIOC
#define Brakelight_Pin GPIO_PIN_7
#define Brakelight_GPIO_Port GPIOC
#define DRS1_PWM_Pin GPIO_PIN_8
#define DRS1_PWM_GPIO_Port GPIOC
#define DRS2_PWM_Pin GPIO_PIN_9
#define DRS2_PWM_GPIO_Port GPIOC
#define Right_Fans_PWM_Pin GPIO_PIN_8
#define Right_Fans_PWM_GPIO_Port GPIOA
#define Right_Fans_Pin GPIO_PIN_15
#define Right_Fans_GPIO_Port GPIOA
#define Left_Fans_Pin GPIO_PIN_6
#define Left_Fans_GPIO_Port GPIOB
#define Accu_Fans_Pin GPIO_PIN_9
#define Accu_Fans_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
